app/views/sessions/new.html.erb

<h1>Login</h1>
<% students =  User.all.select{|u| u.user_type == "student"}%>
---
SELECT "users".* FROM "users"