app/views/users/show.html.erb

SELECT "appointments".* FROM "appointments"  WHERE "appointments"."student_id" = $1  [["student_id", 14]]
---
    <h1>Upcoming Sessions</h1>
    <% open_sessions = Appointment.all.select{|apt| apt.student_id == nil} %>