app/controllers/users_controller.rb

def create
	@user = User.new(user_params)

	if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "telephone", "updated_at", "user_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"